# vsoContextM_Check

## Description
Check an item in the context menu of the object during kObjOnContextMenuInit event.

```pascal
PROCEDURE vsoContextM_Check(
				itemID : INTEGER;
				check  : BOOLEAN);
```

```python
def vs.vsoContextM_Check(itemID, check):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|itemID|INTEGER|   |
|check|BOOLEAN|   |

## Version
Availability: from Vectorworks 2014

## Category
* Object Events